**----------------------------------------------------------------------------------------------------**
# **DATA EXPLORATION**
**----------------------------------------------------------------------------------------------------**

The **data_explorer.py** file is a personal python script in which I use to perform initial exploration of datasets. It uses a function to give key summary features of common data file types. More details on this can be found in the Dataset_Explorer Repository on my Github profile.

In [1]:
# IMPORT DATA EXPLORER PYTHON FILE TO ANALYSE EACH DATASET

import data_explorer

In [2]:
data_explorer.analyze_dataset('data_extracts/accounts.csv')

In [3]:
data_explorer.analyze_dataset('data_extracts/invoices.csv')

In [4]:
data_explorer.analyze_dataset('data_extracts/invoice_line_items.csv')

In [5]:
data_explorer.analyze_dataset('data_extracts/skus.csv')

**----------------------------------------------------------------------------------------------------**
# **PYSPARK ETL Process**
**----------------------------------------------------------------------------------------------------**

In [6]:
# STEP 1: IMPORT REQUIRED LIBRARIES

from pyspark.sql import SparkSession
from pyspark.sql.types import StructType, StructField, IntegerType, StringType, DateType
import warnings

warnings.filterwarnings("ignore")

In [7]:
# STEP 2: CREATE SPARK SESSION

spark = SparkSession.builder.appName("InvoiceETL").getOrCreate()

Setting default log level to "WARN".
To adjust logging level use sc.setLogLevel(newLevel). For SparkR, use setLogLevel(newLevel).
23/08/25 10:38:44 WARN NativeCodeLoader: Unable to load native-hadoop library for your platform... using builtin-java classes where applicable

In [9]:
# STEP 3: LOAD CSV EXTRACTS INTO DATAFRAMES

accounts_df = spark.read.csv("data_extracts/accounts.csv", inferSchema=True, header=True, quote='"', escape="\\", multiLine=True) # USE QUOTE AND MULTILINE FOR company_address
skus_df = spark.read.csv("data_extracts/skus.csv", header=True, inferSchema=True)
invoices_df = spark.read.csv("data_extracts/invoices.csv", header=True, inferSchema=True)
invoice_line_items_df = spark.read.csv("data_extracts/invoice_line_items.csv", header=True, inferSchema=True)

In [10]:
# STEP 4: CREATE TEMP TABLES FOR SPARKSQL

accounts_df.createOrReplaceTempView("accounts")
skus_df.createOrReplaceTempView("skus")
invoices_df.createOrReplaceTempView("invoices")
invoice_line_items_df.createOrReplaceTempView("invoice_line_items")

In [11]:
# STEP 5: TRANSFORM DATAFRAMES INTO FEATURES REQUIRED BY DATA SCIENTISTS

# STEP 5A: CREATE INTERMEDIATE MODEL TO AGGREGATE INVOICE LINE ITEMS

try: 
  
  invoices_total = spark.sql("""

----------------INTERMEDIATE MODEL 'INVOICES_TOTAL' CALCULATES AGGREGATED DATA FOR EACH INVOICE-----------------
---------------------JOINS skus (Stock Keeping Units) INFORMATION INTO invoice_line_items-----------------------
----------------------------THE MODEL IS CREATED TO BE USED LATER IN THE MAIN QUERY-----------------------------

  CREATE OR REPLACE TEMPORARY VIEW invoices_total AS (
      SELECT
        l.invoice_id
        ,SUM(l.quantity) AS total_quantity
        ,ROUND(SUM(s.item_cost_price * l.quantity), 2) AS total_cost_price
        ,ROUND(SUM(s.item_retail_price * l.quantity), 2) AS total_retail_price
          
      FROM invoice_line_items l
        LEFT JOIN skus s
        ON l.item_id = s.item_id

      GROUP BY l.invoice_id
      ORDER BY l.invoice_id )

    """)

  spark.sql("SELECT * FROM invoices_total").show()

except Exception as e:
    # RETRIEVE SQL ERROR MESSAGE
    sql_error_message = str(e)
    print("SQL Error Message:", sql_error_message)

+----------+--------------+----------------+------------------+
|invoice_id|total_quantity|total_cost_price|total_retail_price|
+----------+--------------+----------------+------------------+
|         1|            16|        51850.56|         150688.82|
|         2|             6|         33415.9|          69363.78|
|         3|            15|        74707.57|         147434.99|
|         4|            10|        55635.26|         136826.63|
|         5|            21|        132225.4|         308846.37|
|         6|             8|          4180.4|           9787.72|
|         7|            16|       101173.97|         147924.41|
|         8|            15|        62209.29|         137621.43|
|         9|             5|         6072.95|           11299.5|
|        10|            12|        53269.47|         124059.65|
|        11|            17|         56404.9|          111812.0|
|        12|             3|        13317.12|          35051.03|
|        13|            12|        71612.45|         126570.35|
|        14|            22|       142723.58|         237957.76|
|        15|            23|       111880.43|         214171.37|
|        16|            17|        86547.81|          168124.8|
|        17|             8|        33762.62|          55486.75|
|        18|             7|        36003.75|         100269.37|
|        19|             5|        17056.18|          36407.18|
|        20|            18|        60325.44|         111663.22|
+----------+--------------+----------------+------------------+
only showing top 20 rows

In [12]:
# STEP 5B: FINAL DATAFRAME USING INTERMEDIATE MODEL AND ADDITIONAL CALCULATIONS


try:
  with warnings.catch_warnings():
        warnings.simplefilter("ignore")
  
  invoices_final = spark.sql("""

------------SELECTS ATTRIBUTES RELATED TO INTERMEDIATE MODEL, INVOICES AND ACCOUNTS-------------
-----------------------------USES invoices AS STARTIUNG POINT-----------------------------------
------------------JOINS invoices_total AND accounts INFORMATION INTO invoices-------------------

  SELECT 
    i.invoice_id AS inv_id
    ,i.account_id AS acct_id
    ,t.total_retail_price AS inv_total
    ,t.total_quantity AS inv_items

    ,DATEDIFF(day, a.joining_date, i.date_issued) AS acct_age       --CALCULATE THE ACCOUNT AGE
    
    ,COUNT(i.invoice_id) OVER (PARTITION BY i.account_id 
      ORDER BY i.date_issued 
      RANGE BETWEEN 120 PRECEDING AND 1 PRECEDING) AS num_inv_120d  --COUNT INVOICES IN THE LAST 120 DAYS FROM DATE ISSUED
    
    ,ROW_NUMBER() OVER (PARTITION BY i.account_id 
      ORDER BY i.date_issued, i.invoice_id) AS cum_tot_inv_acct     --CALCULATE CUMULATIVE INVOICES FOR ACCOUNT

    ,CASE 
      WHEN DATEDIFF(i.payment_dates, i.date_issued) > 30 THEN 1
      ELSE 0
     END AS is_late                                                 --BINARY FLAG IF THE INVOICE IS PAID LATE

  FROM invoices i
    LEFT JOIN invoices_total t
    ON i.invoice_id = t.invoice_id

    LEFT JOIN accounts a
    ON a.account_id = i.account_id

  ORDER BY i.invoice_id


  """)

  invoices_final.show()

except Exception as e:
    # RETRIEVE SQL ERROR MESSAGE
    sql_error_message = str(e)
    print("SQL Error Message:", sql_error_message)

+------+-------+---------+---------+--------+------------+----------------+-------+
|inv_id|acct_id|inv_total|inv_items|acct_age|num_inv_120d|cum_tot_inv_acct|is_late|
+------+-------+---------+---------+--------+------------+----------------+-------+
|     1|      1|150688.82|       16|    1626|          23|              56|      1|
|     2|      1| 69363.78|        6|    1433|          17|              22|      0|
|     3|      1|147434.99|       15|    1392|          12|              13|      0|
|     4|      1|136826.63|       10|    1541|          21|              41|      0|
|     5|      1|308846.37|       21|    1600|          20|              50|      0|
|     6|      1|  9787.72|        8|    1424|          17|              20|      0|
|     7|      1|147924.41|       16|    1402|          16|              17|      0|
|     8|      1|137621.43|       15|    1454|          18|              26|      0|
|     9|      1|  11299.5|        5|    1396|          14|              15|      0|
|    10|      1|124059.65|       12|    1506|          21|              33|      0|
|    11|      1| 111812.0|       17|    1560|          19|              44|      1|
|    12|      1| 35051.03|        3|    1394|          13|              14|      0|
|    13|      1|126570.35|       12|    1616|          23|              54|      0|
|    14|      1|237957.76|       22|    1579|          19|              47|      0|
|    15|      1|214171.37|       23|    1374|          10|              11|      1|
|    16|      1| 168124.8|       17|    1313|           4|               5|      0|
|    17|      1| 55486.75|        8|    1413|          17|              18|      0|
|    18|      1|100269.37|        7|    1350|           8|               9|      0|
|    19|      1| 36407.18|        5|    1431|          16|              21|      0|
|    20|      1|111663.22|       18|    1401|          15|              16|      0|
+------+-------+---------+---------+--------+------------+----------------+-------+
only showing top 20 rows

In [13]:
# STEP 6: SAVE FINAL DATASET TO CSV FILE

invoices_final.write.option("header",True) \
                    .option("delimiter",",") \
                    .csv("data_output", header=True, mode="overwrite")

In [14]:
# STEP 7: STOP SPARK SESSION

spark.stop()

**----------------------------------------------------------------------------------------------------**
# **DATA MODELS & DESIGN CHOICES**
**----------------------------------------------------------------------------------------------------**

**Data Model:**

- ETL pipeline built using Spark SQL, intermediate data models created to store the results of different stages of data transformation.

- **Intermediate Model:**
    Invoices_total - aggregated summary of invoice items, total quantity of items, total cost price and total retail price for each invoice. The model simplifies the ETL process and provides a cleaner workflow.

    Additional intermediate models may be used in more complex ETL pipelines to enhance performance and enable data validation.

**Design Choices and Scaling Considerations:**

- **Spark SQL:** Using Spark for the ETL pipeline allows us to process large volumes of data efficiently, thanks to its distributed processing capabilities.

- **Scalability:** By partitioning and distributing data across a cluster, Spark can process data in parallel, making it scalable to handle big data workloads.

- **Data Source and Data Lakes:** The pipeline reads data from CSV files as the data source and writes the final features dataset to a CSV file as the data lake. Depending on the production environment, we might use other data sources and lakes like databases and cloud storage.

- **Testing the ETL Job:** To test the ETL job, we can use unit testing frameworks like PySpark's pyspark.sql.test.DataFrameTest, which allows us to compare expected results with the ETL pipeline's output.